// name	cost8	cost	loc	size	hemisphere	1	2	3	4	5	6	7	8	9	10	11	12	time
const TsvTextFish = `name	cost8	cost	loc	size	hemisphere	1	2	3	4	5	6	7	8	9	10	11	12	time
"紅目鯽,Bitterling"	720	900	河川	特小	北半球	1	1	1	0	0	0	0	0	0	0	1	1	全天
					南半球	0	0	0	0	1	1	1	1	1	0	0	0
"溪哥,Pale chub"	160	200	河川	特小	北半球	1	1	1	1	1	1	1	1	1	1	1	1	9點-16點
					南半球	1	1	1	1	1	1	1	1	1	1	1	1
"鯽魚,Crucian carp"	128	160	河川	小	北半球	1	1	1	1	1	1	1	1	1	1	1	1	全天
					南半球	1	1	1	1	1	1	1	1	1	1	1	1
"珠星三塊魚,Dace"	192	240	河川	中偏小	北半球	1	1	1	1	1	1	1	1	1	1	1	1	16點-9點
					南半球	1	1	1	1	1	1	1	1	1	1	1	1
"鯉魚,Carp"	240	300	池塘	中偏大	北半球	1	1	1	1	1	1	1	1	1	1	1	1	全天
					南半球	1	1	1	1	1	1	1	1	1	1	1	1
"錦鯉,Koi"	3200	4000	池塘	中偏大	北半球	1	1	1	1	1	1	1	1	1	1	1	1	16點-9點
					南半球	1	1	1	1	1	1	1	1	1	1	1	1
"金魚,Goldfish"	1040	1300	池塘	特小	北半球	1	1	1	1	1	1	1	1	1	1	1	1	全天
					南半球	1	1	1	1	1	1	1	1	1	1	1	1
"龍睛金魚,Pop-eyed goldfish"	1040	1300	池塘	特小	北半球	1	1	1	1	1	1	1	1	1	1	1	1	9點-16點
					南半球	1	1	1	1	1	1	1	1	1	1	1	1
"藍壽金魚,Ranchu goldfish"	3600	4500	池塘	小	北半球	1	1	1	1	1	1	1	1	1	1	1	1	9點-16點
					南半球	1	1	1	1	1	1	1	1	1	1	1	1
"淡水龍蝦,Crawfish"	160	200	池塘	小	北半球	0	0	0	1	1	1	1	1	1	0	0	0	全天
					南半球	1	1	1	0	0	0	0	0	0	1	1	1
"鱉,Soft-shelled turtle"	3000	3750	河川	中偏大	北半球	0	0	0	0	0	0	0	1	1	0	0	0	16點-9點
					南半球	0	1	1	0	0	0	0	0	0	0	0	0
"擬鱷龜,Snapping turtle"	4000	5000	河川	中偏大	北半球	0	0	0	1	1	1	1	1	1	1	0	0	21點-4點
					南半球	1	1	1	1	0	0	0	0	0	1	1	1
"蝌蚪,Tadpole"	80	100	池塘	特小	北半球	0	0	1	1	1	1	1	0	0	0	0	0	全天
					南半球	1	0	0	0	0	0	0	0	1	1	1	1
"青蛙,Frog"	96	120	池塘	小	北半球	0	0	0	0	1	1	1	1	0	0	0	0	全天
					南半球	1	1	0	0	0	0	0	0	0	0	1	1
"塘鱧魚,Freshwater goby"	320	400	河川	小	北半球	1	1	1	1	1	1	1	1	1	1	1	1	16點-9點
					南半球	1	1	1	1	1	1	1	1	1	1	1	1
"泥鰍,Loach"	320	400	河川	小	北半球	0	0	1	1	1	0	0	0	0	0	0	0	全天
					南半球	0	0	0	0	0	0	0	0	1	1	1	0
"鯰魚,Catfish"	640	800	池塘	中偏大	北半球	0	0	0	0	1	1	1	1	1	1	0	0	16點-9點
					南半球	1	1	1	1	0	0	0	0	0	0	1	1
"藍鰓太陽魚,Bluegill"	144	180	河川	小	北半球	1	1	1	1	1	1	1	1	1	1	1	1	9點-16點
					南半球	1	1	1	1	1	1	1	1	1	1	1	1
"黃鱸魚,Yellow perch"	240	300	河川	中偏小	北半球	1	1	1	0	0	0	0	0	0	1	1	1	全天
					南半球	0	0	0	1	1	1	1	1	1	0	0	0
"黑鱸魚,Black bass"	320	400	河川	中偏大	北半球	1	1	1	1	1	1	1	1	1	1	1	1	全天
					南半球	1	1	1	1	1	1	1	1	1	1	1	1
"吳郭魚,Tilapia"	640	800	河川	中偏小	北半球	0	0	0	0	0	1	1	1	1	1	0	0	全天
					南半球	1	1	1	1	0	0	0	0	0	0	0	1
"白斑狗魚,Pike"	1440	1800	河川	大	北半球	0	0	0	0	0	0	0	0	1	1	1	1	全天
					南半球	0	0	1	1	1	1	0	0	0	0	0	0
"香魚,Sweetfish"	720	900	河川	中偏小	北半球	0	0	0	0	0	0	1	1	1	0	0	0	全天
					南半球	1	1	1	0	0	0	0	0	0	0	0	0
"櫻花鉤吻鮭,Cherry salmon"	800	1000	懸崖上	中偏小	北半球	0	0	1	1	1	1	0	0	1	1	1	0	全天
					南半球	0	0	1	1	1	0	0	0	1	1	1	1
"花羔紅點鮭,Char"	3040	3800	懸崖上	中偏小	北半球	0	0	1	1	1	1	0	0	1	1	1	0	全天
					南半球	0	0	1	1	1	0	0	0	1	1	1	1
"金鱒,Golden trout"	12000	15000	懸崖上	中偏小	北半球	0	0	1	1	1	0	0	0	1	1	1	0	16點-9點
					南半球	0	0	1	1	1	0	0	0	1	1	1	0
"遠東哲羅魚,Stringfish"	12000	15000	懸崖上	大	北半球	1	1	1	0	0	0	0	0	0	0	0	1	16點-9點
					南半球	0	0	0	0	0	1	1	1	1	0	0	0
"鮭魚,Salmon"	560	700	出海口	中偏大	北半球	0	0	0	0	0	0	0	0	1	0	0	0	全天
					南半球	0	0	1	0	0	0	0	0	0	0	0	0
"帝王鮭,King salmon"	1440	1800	出海口	大	北半球	0	0	0	0	0	0	0	0	1	0	0	0	全天
					南半球	0	0	1	0	0	0	0	0	0	0	0	0
"中華絨螯蟹,Mitten crab"	1600	2000	河川	小	北半球	0	0	0	0	0	0	0	0	1	1	1	0	16點-9點
					南半球	0	1	1	1	0	0	0	0	0	0	0	0
"孔雀魚,Guppy"	1040	1300	河川	特小	北半球	0	0	0	1	1	1	1	1	1	1	1	0	9點-16點
					南半球	1	1	1	1	1	0	0	0	0	1	1	1
"溫泉醫生魚,Nibble fish"	1200	1500	河川	特小	北半球	0	0	0	0	1	1	1	1	1	0	0	0	9點-16點
					南半球	1	1	1	0	0	0	0	0	0	0	1	1
"神仙魚,Angelfish"	2400	3000	河川	小	北半球	0	0	0	0	1	1	1	1	1	1	0	0	16點-9點
					南半球	1	1	1	1	0	0	0	0	0	0	1	1
"鬥魚,Betta"	2000	2500	河川	小	北半球	0	0	0	0	1	1	1	1	1	1	0	0	9點-16點
					南半球	1	1	1	1	0	0	0	0	0	0	1	1
"霓虹燈魚,Neon tetra"	400	500	河川	特小	北半球	0	0	0	1	1	1	1	1	1	1	1	0	9點-16點
					南半球	1	1	1	1	1	0	0	0	0	1	1	1
"彩虹魚,Rainbowfish"	640	800	河川	小	北半球	0	0	0	0	1	1	1	1	1	1	0	0	9點-16點
					南半球	1	1	1	1	0	0	0	0	0	0	1	1
"食人魚,Piranha"	2000	2500	河川	小	北半球	0	0	0	0	0	1	1	1	1	0	0	0	"9點-16點,21點-4點"
					南半球	1	1	1	0	0	0	0	0	0	0	0	1
"骨舌魚,Arowana"	8000	10000	河川	中偏大	北半球	0	0	0	0	0	1	1	1	1	0	0	0	16點-9點
					南半球	1	1	1	0	0	0	0	0	0	0	0	1
"黃金河虎,Dorado"	12000	15000	河川	大	北半球	0	0	0	0	0	1	1	1	1	0	0	0	4點-21點
					南半球	1	1	1	0	0	0	0	0	0	0	0	1
"雀鱔,Gar"	4800	6000	池塘	大	北半球	0	0	0	0	0	1	1	1	1	0	0	0	16點-9點
					南半球	1	1	1	0	0	0	0	0	0	0	0	1
"巨骨舌魚,Arapaima"	8000	10000	河川	特大	北半球	0	0	0	0	0	1	1	1	1	0	0	0	16點-9點
					南半球	1	1	1	0	0	0	0	0	0	0	0	1
"恩氏多鰭魚,Saddled bichir"	3200	4000	河川	中偏大	北半球	0	0	0	0	0	1	1	1	1	0	0	0	21點-4點
					南半球	1	1	1	0	0	0	0	0	0	0	0	1
"鱘魚,Sturgeon"	8000	10000	出海口	特大	北半球	1	1	1	0	0	0	0	0	1	1	1	1	全天
					南半球	0	0	1	1	1	1	1	1	1	0	0	0
"海天使,Sea butterfly"	800	1000	大海	特小	北半球	1	1	1	0	0	0	0	0	0	0	0	1	全天
					南半球	0	0	0	0	0	1	1	1	1	0	0	0
"海馬,Seahorse"	880	1100	大海	特小	北半球	0	0	0	1	1	1	1	1	1	1	1	0	全天
					南半球	1	1	1	1	1	0	0	0	0	1	1	1
"小丑魚,Clownfish"	520	650	大海	特小	北半球	0	0	0	1	1	1	1	1	1	0	0	0	全天
					南半球	1	1	1	0	0	0	0	0	0	1	1	1
"擬刺尾鯛,Surgeonfish"	800	1000	大海	小	北半球	0	0	0	1	1	1	1	1	1	0	0	0	全天
					南半球	1	1	1	0	0	0	0	0	0	1	1	1
"耳帶蝴蝶魚,Butterfly fish"	800	1000	大海	小	北半球	0	0	0	1	1	1	1	1	1	0	0	0	全天
					南半球	1	1	1	0	0	0	0	0	0	1	1	1
"蘇眉魚,Napoleonfish"	8000	10000	大海	特大	北半球	0	0	0	0	0	0	1	1	0	0	0	0	--
					南半球	1	1	0	0	0	0	0	0	0	0	0	0
"獅子魚,Zebra turkeyfish"	400	500	大海	中偏小	北半球	0	0	0	1	1	1	1	1	1	1	1	0	全天
					南半球	1	1	1	1	1	0	0	0	0	1	1	1
"河豚,Blowfish"	4000	5000	大海	中偏小	北半球	1	1	1	1	1	1	1	1	1	1	1	1	--
					南半球	1	1	1	1	1	1	1	1	1	1	1	1
"刺河豚,Puffer fish"	200	250	大海	中偏小	北半球	0	0	0	0	0	0	1	1	1	0	0	0	全天
					南半球	1	1	1	0	0	0	0	0	0	0	0	0
"鳳尾魚,Anchovy"	160	200	大海	小	北半球	1	1	1	1	1	1	1	1	1	1	1	1	4點-21點
					南半球	1	1	1	1	1	1	1	1	1	1	1	1
"竹筴魚,Horse mackerel"	120	150	大海	小	北半球	1	1	1	1	1	1	1	1	1	1	1	1	全天
					南半球	1	1	1	1	1	1	1	1	1	1	1	1
"條石鯛,Barred knifejaw"	4000	5000	大海	中偏小	北半球	0	0	1	1	1	1	1	1	1	1	1	0	全天
					南半球	1	1	1	1	1	0	0	0	1	1	1	1
"鱸魚,Sea bass"	320	400	大海	大	北半球	1	1	1	1	1	1	1	1	1	1	1	1	全天
					南半球	1	1	1	1	1	1	1	1	1	1	1	1
"鯛魚,Red snapper"	2400	3000	大海	中偏大	北半球	1	1	1	1	1	1	1	1	1	1	1	1	全天
					南半球	1	1	1	1	1	1	1	1	1	1	1	1
"鰈魚,Dab"	240	300	大海	中偏小	北半球	1	1	1	1	0	0	0	0	0	1	1	1	全天
					南半球	0	0	0	1	1	1	1	1	1	1	0	0
"比目魚,Olive flounder"	640	800	大海	大	北半球	1	1	1	1	1	1	1	1	1	1	1	1	全天
					南半球	1	1	1	1	1	1	1	1	1	1	1	1
"魷魚,Squid"	400	500	大海	中偏小	北半球	1	1	1	1	1	1	1	1	0	0	0	1	全天
					南半球	1	1	0	0	0	1	1	1	1	1	1	1
"裸胸鱔,Moray eel"	1600	2000	大海	細長	北半球	0	0	0	0	0	0	0	1	1	1	0	0	全天
					南半球	0	1	1	1	0	0	0	0	0	0	0	0
"五彩鰻,Ribbon eel"	480	600	大海	細長	北半球	0	0	0	0	0	1	1	1	1	1	0	0	全天
					南半球	1	1	1	1	0	0	0	0	0	0	0	1
"鮪魚,Tuna"	5600	7000	碼頭	特大	北半球	1	1	1	0	0	0	0	0	0	0	1	1	全天
					南半球	0	0	0	0	1	1	1	1	1	0	0	0
"旗魚,Blue marlin"	8000	10000	碼頭	特大	北半球	1	1	1	1	0	0	1	1	1	0	1	1	全天
					南半球	1	1	1	1	1	1	1	1	1	1	1	1
"浪人?,Giant trevally"	3600	4500	碼頭	大	北半球	0	0	0	0	1	1	1	1	1	1	0	0	全天
					南半球	1	1	1	1	0	0	0	0	0	0	1	1
"鬼頭刀,Mahi-mahi"	4800	6000	碼頭	大	北半球	0	0	0	0	1	1	1	1	1	1	0	0	全天
					南半球	1	1	1	1	0	0	0	0	0	0	1	1
"翻車魚,Ocean sunfish"	3200	4000	大海	背鰭	北半球	0	0	0	0	0	0	1	1	1	0	0	0	4點-21點
					南半球	1	1	1	0	0	0	0	0	0	0	0	0
"魟魚,Ray"	2400	3000	大海	大	北半球	0	0	0	0	0	0	0	1	1	1	1	0	4點-21點
					南半球	0	1	1	1	1	0	0	0	0	0	0	0
"鋸鯊,Saw shark"	9600	12000	大海	背鰭	北半球	0	0	0	0	0	1	1	1	1	0	0	0	16點-9點
					南半球	1	1	1	0	0	0	0	0	0	0	0	1
"雙髻鯊,Hammerhead shark"	6400	8000	大海	背鰭	北半球	0	0	0	0	0	1	1	1	1	0	0	0	16點-9點
					南半球	1	1	1	0	0	0	0	0	0	0	0	1
"鯊魚,Great white shark"	12000	15000	大海	背鰭	北半球	0	0	0	0	0	1	1	1	1	0	0	0	16點-9點
					南半球	1	1	1	0	0	0	0	0	0	0	0	1
"鯨鯊,Whale shark"	10400	13000	大海	背鰭	北半球	0	0	0	0	0	1	1	1	1	0	0	0	全天
					南半球	1	1	1	0	0	0	0	0	0	0	0	1
"吸盤魚,Suckerfish"	1200	1500	大海	背鰭	北半球	0	0	0	0	0	1	1	1	1	0	0	0	全天
					南半球	1	1	1	0	0	0	0	0	0	0	0	1
"燈籠魚,Football fish"	2000	2500	大海	中偏大	北半球	1	1	1	0	0	0	0	0	0	0	1	1	16點-9點
					南半球	0	0	0	0	1	1	1	1	1	0	0	0
"皇帶魚,Oarfish"	7200	9000	大海	特大	北半球	1	1	1	1	1	0	0	0	0	0	0	1	全天
					南半球	0	0	0	0	0	1	1	1	1	1	1	0
"太平洋桶眼魚,Barreleye"	12000	15000	大海	小	北半球	1	1	1	1	1	1	1	1	1	1	1	1	21點-4點
					南半球	1	1	1	1	1	1	1	1	1	1	1	1
"矛尾魚,Coelacanth"	12000	15000	大海(雨天)	特大	北半球	1	1	1	1	1	1	1	1	1	1	1	1	全天
					南半球	1	1	1	1	1	1	1	1	1	1	1	1	`;